In [1]:
import pandas as pd

df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
# finding unique values in a dataframe

# find all unique values in col 2

df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
# get count of unique

len(df['col2'].unique())

3

In [5]:
# or...
df['col2'].nunique()

3

In [6]:
# get counts of how many times each value occurs

df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [7]:
# selecting data
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [10]:
# review : combine conditions

df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [12]:
# apply method : 

def times2(x):
    return x*2

In [13]:
df['col1'].sum()

10

In [14]:
# pass in a function to apply to the dataframe selection

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [15]:
# or use standard methods

df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [16]:
# combine times2 with a lambda expression

df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [17]:
# removing columns

df.drop('col1',axis=1)  # specify axis=1 for col

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [18]:
# get col and index names
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
# order / sort a column

df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [22]:
# find null values

df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [23]:
# pivot table

data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [24]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [25]:
# create pivot table

df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [27]:
df.pivot_table(values='D',index=['A'],columns='C',aggfunc='sum')

C    x  y
A
bar  4  6
foo  3  3